spec/fixtures/cassettes/Spree_PaymentMethod_StripeSofort/_authorize/creates_source_and_saves_response.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/sources
    body:
      encoding: UTF-8
      string: type=sofort&amount=995&currency=eur&owner[email]=john.snow%40thewall.com&owner[name]=Dick+Grayson&metadata[order_id]=R313449283&redirect[return_url]=http%3A%2F%2Flocalhost%3A3000%2Freturn&sofort[country]=DE&statement_descriptor=Spree+Order+ID%3A+
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.3.1
      Authorization:
      - Bearer sk_test_AsrDm8kqu1cwROiD53jbVaXq
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.3.1","lang":"ruby","lang_version":"2.3.4 p301 (2017-03-30)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jun 15 17:36:27
        PDT 2017; root:xnu-3789.70.16~2/RELEASE_X86_64 x86_64","hostname":"MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Sep 2017 10:52:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1070'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6jsW5zrrKFwVfG
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "src_1B45owBxRuikat2VMLUj1qld",
          "object": "source",
          "amount": 995,
          "client_secret": "src_client_secret_BQxkjd7S8VgPFpV2IX3DF3Pb",
          "created": 1505904766,
          "currency": "eur",
          "flow": "redirect",
          "livemode": false,
          "metadata": {
            "order_id": "R313449283"
          },
          "owner": {
            "address": null,
            "email": "john.snow@thewall.com",
            "name": "Dick Grayson",
            "phone": null,
            "verified_address": null,
            "verified_email": null,
            "verified_name": null,
            "verified_phone": null
          },
          "redirect": {
            "return_url": "http://localhost:3000/return",
            "status": "pending",
            "url": "https://hooks.stripe.com/redirect/authenticate/src_1B45owBxRuikat2VMLUj1qld?client_secret=src_client_secret_BQxkjd7S8VgPFpV2IX3DF3Pb"
          },
          "statement_descriptor": "Spree Order ID: ",
          "status": "pending",
          "type": "sofort",
          "usage": "single_use",
          "sofort": {
            "country": "DE",
            "bank_code": null,
            "bic": null,
            "bank_name": null,
            "iban_last4": null,
            "statement_descriptor": null,
            "preferred_language": null
          }
        }
    http_version: 
  recorded_at: Wed, 20 Sep 2017 10:52:45 GMT
recorded_with: VCR 3.0.3
