spec/fixtures/cassettes/Spree_PaymentMethod_StripeSofort/_capture_request/makes_capture_request_and_proceesses_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/sources
    body:
      encoding: UTF-8
      string: type=sofort&amount=885&currency=eur&owner[email]=john.snow%40thewall.com&owner[name]=Dick+Grayson&metadata[order_id]=R618120936&redirect[return_url]=http%3A%2F%2Flocalhost%3A3000%2Freturn&sofort[country]=DE&statement_descriptor=Spree+Order+ID%3A+
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.3.1
      Authorization:
      - Bearer sk_test_AsrDm8kqu1cwROiD53jbVaXq
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.3.1","lang":"ruby","lang_version":"2.3.4 p301 (2017-03-30)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jun 15 17:36:27
        PDT 2017; root:xnu-3789.70.16~2/RELEASE_X86_64 x86_64","hostname":"MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Sep 2017 12:18:09 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1070'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_TMYGfLuTibKaFF
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "src_1B479ZBxRuikat2VCuPWkVuY",
          "object": "source",
          "amount": 885,
          "client_secret": "src_client_secret_BQz7NUAjcACZEczpcDXD8Vve",
          "created": 1505909889,
          "currency": "eur",
          "flow": "redirect",
          "livemode": false,
          "metadata": {
            "order_id": "R618120936"
          },
          "owner": {
            "address": null,
            "email": "john.snow@thewall.com",
            "name": "Dick Grayson",
            "phone": null,
            "verified_address": null,
            "verified_email": null,
            "verified_name": null,
            "verified_phone": null
          },
          "redirect": {
            "return_url": "http://localhost:3000/return",
            "status": "pending",
            "url": "https://hooks.stripe.com/redirect/authenticate/src_1B479ZBxRuikat2VCuPWkVuY?client_secret=src_client_secret_BQz7NUAjcACZEczpcDXD8Vve"
          },
          "statement_descriptor": "Spree Order ID: ",
          "status": "pending",
          "type": "sofort",
          "usage": "single_use",
          "sofort": {
            "country": "DE",
            "bank_code": null,
            "bic": null,
            "bank_name": null,
            "iban_last4": null,
            "statement_descriptor": null,
            "preferred_language": null
          }
        }
    http_version: 
  recorded_at: Wed, 20 Sep 2017 12:18:09 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/sources
    body:
      encoding: UTF-8
      string: type=sofort&amount=885&currency=eur&owner[email]=john.snow%40thewall.com&owner[name]=Dick+Grayson&metadata[order_id]=R618120936&redirect[return_url]=http%3A%2F%2Flocalhost%3A3000%2Freturn&sofort[country]=DE&statement_descriptor=Spree+Order+ID%3A+
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.3.1
      Authorization:
      - Bearer sk_test_AsrDm8kqu1cwROiD53jbVaXq
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.3.1","lang":"ruby","lang_version":"2.3.4 p301 (2017-03-30)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jun 15 17:36:27
        PDT 2017; root:xnu-3789.70.16~2/RELEASE_X86_64 x86_64","hostname":"MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Sep 2017 12:18:24 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1070'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AvhCw7cS0KMo1d
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "src_1B479oBxRuikat2V7Lw5g6qA",
          "object": "source",
          "amount": 885,
          "client_secret": "src_client_secret_BQz8RfCMqNUYl8Ehufxeprol",
          "created": 1505909904,
          "currency": "eur",
          "flow": "redirect",
          "livemode": false,
          "metadata": {
            "order_id": "R618120936"
          },
          "owner": {
            "address": null,
            "email": "john.snow@thewall.com",
            "name": "Dick Grayson",
            "phone": null,
            "verified_address": null,
            "verified_email": null,
            "verified_name": null,
            "verified_phone": null
          },
          "redirect": {
            "return_url": "http://localhost:3000/return",
            "status": "pending",
            "url": "https://hooks.stripe.com/redirect/authenticate/src_1B479oBxRuikat2V7Lw5g6qA?client_secret=src_client_secret_BQz8RfCMqNUYl8Ehufxeprol"
          },
          "statement_descriptor": "Spree Order ID: ",
          "status": "pending",
          "type": "sofort",
          "usage": "single_use",
          "sofort": {
            "country": "DE",
            "bank_code": null,
            "bic": null,
            "bank_name": null,
            "iban_last4": null,
            "statement_descriptor": null,
            "preferred_language": null
          }
        }
    http_version: 
  recorded_at: Wed, 20 Sep 2017 12:18:23 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=885&currency=eur&source=src_1B479oBxRuikat2V7Lw5g6qA
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.3.1
      Authorization:
      - Bearer sk_test_AsrDm8kqu1cwROiD53jbVaXq
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.3.1","lang":"ruby","lang_version":"2.3.4 p301 (2017-03-30)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jun 15 17:36:27
        PDT 2017; root:xnu-3789.70.16~2/RELEASE_X86_64 x86_64","hostname":"MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Sep 2017 12:18:55 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2292'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_HYP5s7Ul0gMbqN
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "py_1B47AJBxRuikat2VOL91NAQB",
          "object": "charge",
          "amount": 885,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "balance_transaction": null,
          "captured": true,
          "created": 1505909935,
          "currency": "eur",
          "customer": null,
          "description": null,
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "not_assessed",
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": false,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/py_1B47AJBxRuikat2VOL91NAQB/refunds"
          },
          "review": null,
          "shipping": null,
          "source": {
            "id": "src_1B479oBxRuikat2V7Lw5g6qA",
            "object": "source",
            "amount": 885,
            "client_secret": "src_client_secret_BQz8RfCMqNUYl8Ehufxeprol",
            "created": 1505909935,
            "currency": "eur",
            "flow": "redirect",
            "livemode": false,
            "metadata": {
              "order_id": "R618120936"
            },
            "owner": {
              "address": null,
              "email": "john.snow@thewall.com",
              "name": "Dick Grayson",
              "phone": null,
              "verified_address": null,
              "verified_email": null,
              "verified_name": "Jenny Rosen",
              "verified_phone": null
            },
            "redirect": {
              "return_url": "http://localhost:3000/return",
              "status": "succeeded",
              "url": "https://hooks.stripe.com/redirect/authenticate/src_1B479oBxRuikat2V7Lw5g6qA?client_secret=src_client_secret_BQz8RfCMqNUYl8Ehufxeprol"
            },
            "statement_descriptor": "Spree Order ID: ",
            "status": "consumed",
            "type": "sofort",
            "usage": "single_use",
            "sofort": {
              "country": "DE",
              "bank_code": "DEUT",
              "bank_name": "Deutsche Bank",
              "bic": "DEUTDE2H",
              "iban_last4": "4567",
              "statement_descriptor": null,
              "preferred_language": null
            }
          },
          "source_transfer": null,
          "statement_descriptor": null,
          "status": "pending",
          "transfer_group": null
        }
    http_version: 
  recorded_at: Wed, 20 Sep 2017 12:18:55 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=885&currency=eur&source=src_1B479oBxRuikat2V7Lw5g6qA
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.3.1
      Authorization:
      - Bearer sk_test_AsrDm8kqu1cwROiD53jbVaXq
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.3.1","lang":"ruby","lang_version":"2.3.4 p301 (2017-03-30)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jun 15 17:36:27
        PDT 2017; root:xnu-3789.70.16~2/RELEASE_X86_64 x86_64","hostname":"MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Sep 2017 12:19:00 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '129'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_U4rjrWfNhjZERe
      Stripe-Version:
      - '2017-08-15'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "type": "invalid_request_error",
            "message": "The source you provided is not in a chargeable state."
          }
        }
    http_version: 
  recorded_at: Wed, 20 Sep 2017 12:18:59 GMT
recorded_with: VCR 3.0.3
